src/InformationRegisters/Рекламаторы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>Рекламаторы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УникальныйИдентификаторДоступа</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/Рекламаторы/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

// Процедура обновляет регистр с рекламаторами
//
Процедура ИнициализацияДоступаРекламаторам(СтруктураПараметров) Экспорт  	
	
	Для Каждого Документ Из СтруктураПараметров.МассивДокументов Цикл 
		НаборЗаписей = РегистрыСведений.Рекламаторы.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.СтруктурнаяЕдиница.Установить(СтруктураПараметров.СтруктурнаяЕдиница);
		НаборЗаписей.Отбор.Документ.Установить(Документ);
		НаборЗаписей.Отбор.Пользователь.Установить(СтруктураПараметров.АвторДокумента);
		НаборЗаписей.Отбор.УникальныйИдентификаторДоступа.Установить(СтруктураПараметров.УникальныйИдентификаторДоступа);
		Если СтруктураПараметров.Режим = "Открыть" Тогда 
			НоваяСтрока = НаборЗаписей.Добавить();
			НоваяСтрока.СтруктурнаяЕдиница 				= СтруктураПараметров.СтруктурнаяЕдиница;
			НоваяСтрока.Документ 						= Документ;
			НоваяСтрока.Пользователь 					= СтруктураПараметров.АвторДокумента;
			НоваяСтрока.УникальныйИдентификаторДоступа 	= СтруктураПараметров.УникальныйИдентификаторДоступа;
			НаборЗаписей.Записать(Истина);		
		ИначеЕсли СтруктураПараметров.Режим = "Закрыть" Тогда
			Если СтруктураПараметров.ВыбранныйДокумент <> Неопределено И СтруктураПараметров.ВыбранныйДокумент = Документ Тогда
				Продолжить;
			Иначе 	
				НаборЗаписей.Записать();
			КонецЕсли;
		КонецЕсли;			       
	КонецЦикла;
	
КонецПроцедуры

// Процедура удаляет все записи для определенного пользователя
//
Процедура УдалитьЗаписиПользователя(Пользователь, СтруктурнаяЕдиница) Экспорт
	
	НаборЗаписей = РегистрыСведений.Рекламаторы.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.СтруктурнаяЕдиница.Установить(СтруктурнаяЕдиница);
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	НаборЗаписей.Записать();	
	
КонецПроцедуры

#КонецОбласти
